app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", ""], ["LIMIT", 1]]
---
  def self.find_by_creds(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "xcZ6hA72AhL2jDm88Mvt2Q"], ["updated_at", "2019-09-12 02:22:54.483982"], ["id", 6]]
---
  def reset_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!